Repository: i-zanis/array-digital-wardrobe
Catalog: lib/l10n/arb/app_*.arb
Languages: ar, el, th

# locale
source: en
ar: ar
el: el_GR
th: th

# appName
source: Array Digital Wardrobe App
ar: اراي
el: Array ψηφιακή εφαρμογή γκαρνταρόμπας

# description
source: The description
ar: تطبيق اراي
el: Περιγραφή

# homeScreenGreeting
source: Hello,
ar: مرحبا
el: Γειά σου,
th: สวัสดี

# homeScreenTitle
source: This is your Array
ar: هذا تطبيق اراي
el: Αυτός είναι ο Πίνακας σας

# homeScreenDescription
source: The description
ar: الوصف
el: Περιγραφή

# type
source: The type
ar: النوع
el: Τύπος
th: ประเภท

source: Body Measurement
ar: قياسات الجسم
el: Μέτρηση σώματος
th: มาตราส่วนร่างกาย

# homeScreenWeatherError
source: Error getting weather
ar: تعذر البحث عن احوال الطقس
el: Σφάλμα με τον καιρό
th: ไม่สามารถแสดงสภาพอากาศได้

# homeScreenLabelItems
source: Items
ar: الملابس
el: Είδη
th: ไอเทม

# homeScreenLabelValue
source: Value
ar: الثمن
el: Αξία
th: มูลค่า

# homeScreenLabelLooks
source: Looks
ar: المظهر
el: Look
th: ลุค

# latestItemTitle
source: Latest Items
ar: أحدث الملابس
el: Τελευταία είδη
th: ไอเทมล่าสุด

source: See favourite item
ar: ملابسك المفضلة
el: Αγαπημένα είδη
th: ดูไอเทมโปรด

# latestLookTitle
source: Latest Looks
ar: احدث المظاهر
el: Τελευταία Look
th: ลุคล่าสุด

source: See Favourite look
ar: مظاهرك المفضلة
el: Αγαπημένα look
th: ดูลุคโปรด

# itemLoadError
source: Error loading items
ar: تعذر تحميل الاغراض
el: Σφάλμα φόρτωσης
th: ไม่สามารถโหลดไอเทมได้

# lookBookScreenTitle
source: Lookbook
ar: مظاهر
th: ลุคทั้งหมด

# lookBookScreenSubtitle
source: Create looks from existing items
ar: اختيار مظهر جديد من الاغراض الموجودة
el: Δημιουργία Look
th: สร้างลุคใหม่จากไอเทมปัจจุบัน

# lookBookScreenLatestLook
source: Latest look
ar: احدث المظاهر
el: Τελευταία look
th: ลุคล่าสุด

# lookBookScreenSeeFavouriteLook
source: See favourite look
ar: مظاهرك المفضلة
el: Αγαπημένα look
th: ดูลุคโปรด

# lookBookScreenSearchBarHint
source: Search by name or tag
ar: البحث بواسطة الاسم او الملصق
el: Αναζήτηση με όνομα/ετικέτα
th: ค้นหาจากชื่อหรือแท็ก

# lookBookScreenMixAndMatch
source: Mix & Match
ar: خلط وتركيب
el: Μίξαρε και ταίριαξε
th: จับคู่ไอเทม

# lookProfileScreenTitle
source: Look Profile
ar: معلومات عن المظهر
el: Προφίλ Look
th: ลุคบุ๊ค

# lookProfileScreenTitleNew
source: Mix & Match
ar: اضافة مظهر جديد
el: Μίξαρε και ταίριαξε
th: จับคู่ไอเทม

# lookProfileScreenSubtleSubtitle
source: This is your look
ar: هذا هو مظهرك
el: Το look σου
th: นี่คือลุคของคุณ

# lookProfileScreenSubtitleNew
source: Modify look details
ar: تعديل المظهر
el: Προσάρμοσε το look σου
th: แก้ไขรายละเอียดของลุค

# lookProfilePlaceholderLookName
source: Name this look
ar: سمي المظهر
el: Ονόμασε το look σου
th: ตั้งชื่อลุคนี้

# lookProfileScreenLabelTag
source: Tag
ar: الملصقات
el: Ετικέτα
th: แท็ก

# lookProfileScreenLabelItems
source: Items in this look
ar: ملابس هذا المظهر
el: Είδη σε αυτό το look
th: ไอเทมในลุคนี้

# lookProfileScreenLabelHowDoILook
source: How do I look
ar: كيف ابدو؟
el: Πώς μοιάζω
th: ฉันดูเป็นอย่างไรในลุคนี้

# lookProfileScreenButtonSave
source: Save
ar: حفظ
el: Αποθήκευση
th: บันทึก

# lookProfileScreenStudioTitle
source: Look Studio
ar: ستوديو المظاهر
el: Στούντιο Look
th: สตูดิโอ

# lookProfileScreenStudioSubtitle
source: Assemble your look
ar: تركيب مظهرك
el: Δημιουργία Look
th: สร้างลุคใหม่จากไอเทมปัจจุบัน

# mixAndMatchScreenTitle
source: Mix & Match
ar: خلط وتركيب
el: Μίξαρε και ταίριαξε
th: จับคู่ไอเทม

# mixAndMatchScreenSubtitle
source: Choose categories to match
ar: اختر و نسق بين الاصناف
el: Δίαλεξε κατηγορία
th: เลือกไอเทมจากแต่ละประเภท

# mixAndMatchScreenButtonContinue
source: Continue
ar: استمر
el: Συνέχεια
th: ถัดไป

# mixAndMatchNoCategorySelectedError
source: Please select at least one category
ar: الرجاء اختيار صنف واحد على الأقل
el: Επέλεξε κατηγορία
th: กรุณาเลือกประเภท

# mixAndMatchAddFromWardrobe
source: Add from wardrobe
ar: اضف من الخزانة
el: Πρόσθεσε από την γκαρνταρόμπα
th: เลือกจากตู้เสื้อผ้า

# mixAndMatchConfirm
source: Confirm
ar: تأكيد
el: Επιβεβαίωση
th: ยืนยัน

# mixAndMatchResultScreenConfirmError
source: Please select items from wardrobe
ar: الرجاء اختيار الملابس من الخزانة
el: Έπέλεξε τουλάχιστον 2 είδη
th: กรุณาเลือกไอเทมจากตู้เสื้อผ้า

# wardrobeScreenTitle
source: Wardrobe
ar: الخزانة
el: Γκαρνταρόμπα
th: ตู้เสื้อผ้า

# wardrobeScreenSubtitle
source: Clothing Collection
ar: هذه هي الملابس التي اضفتها الى خزانتك
el: Συλόγή ρούχων
th: คอเล็คชั่นเสื้อผ้า

# itemProfileScreenTitleNew
source: Wardrobe Addition
ar: لباس جديد
el: Προσθήκη
th: ส่วนเสริมของตู้เสื้อผ้า

# itemProfileScreenSubtitleNew
source: Add details to your new item
ar: أضف معلومات عن لباسك الجديد
el: Προσθήκη λεπτομερειών
th: เพิ่มรายละเอียดในไอเทมใหม่

# itemProfileScreenTitle
source: Item Profile
ar: معلومات عن اللباس
el: Προφίλ είδους
th: ไอเทมโปรไล์

# itemProfileScreenSubtitle
source: Modify item details
ar: تعديل معلومات اللباس
el: Προσαρμογή λεπτομερειών
th: แก้ไขข้อมูลไอเทม

# itemProfileScreenNamePlaceHolder
source: Name this item
ar: سمي هذا اللباس
el: Ονόμασε το είδος
th: ตั้งชื่อไอเทม

# itemProfileScreenLabelBrand
source: Brand
ar: العلامة التجارية
el: Μάρκα
th: แบรนด์

# itemProfileScreenLabelSize
source: Size
ar: المقاس
el: Νούμερο
th: ไซส์

# itemProfileScreenLabelColor
source: Colour
ar: اللون
el: Χρώμα
th: สี

# itemProfileScreenLabelPrice
source: Price
ar: الثمن
el: Τιμή
th: ราคา

# itemProfileScreenLabelTag
source: Tag
ar: الملصقات
el: Ετικέτα
th: แท็ก

# itemProfileScreenLabelOther
source: Other Details
ar: معلومات أخرى
el: Λεπτομέρειες
th: รายละเอียดอื่นๆ

# itemProfileScreenNotificationDelete
source: Deleting...
ar: بصدد الحذف
th: กำลังลบ...

# itemProfileScreenNotificationSave
source: Saving...
ar: بصدد الحفظ
el: Αποθήκευση...
th: กำลังบันทึก...

# itemProfileScreenItemCreationTitle
source: Wardrobe Addition
ar: إضافت شيء للخزانة
el: Προσθήκη γκαρνταρόμπας
th: ส่วนเสริมของตู้เสื้อผ้า

# itemProfileScreenItemCreationSubtitle
source: Select category
ar: اختر صنف
el: Δίαλεξε κατηγορία
th: เลือกประเภท

# itemProfileScreenItemCreationButton
source: Save
ar: حفظ
el: Αποθήκευση
th: บันทึก

# itemProfileScreenDialogDeleteTitle
source: Delete Item
ar: حذف اللباس
th: ลบไอเทม

# itemProfileScreenDialogDeleteMessage
source: Are you sure you want to delete this item?
ar: هل تريد حذف هذا اللباس؟
th: คุณต้องการลบไอเทมนี้หรือไม่?

# itemProfileScreenDialogDeleteButtonCancel
source: Cancel
ar: إلغاء
th: ยกเลิก

# itemProfileScreenDialogDeleteButtonDelete
source: Delete
ar: حذف
th: ลบ

# appBarHome
source: Home
ar: الرئيسية
th: หน้าหลัก

# appBarLookBook
source: LookBook
ar: المظاهر
th: ลุคบุ๊ค

# appBarWardrobe
source: Wardrobe
ar: الخزانة
el: Γκαρνταρόμπα
th: ตู้เสื้อผ้า

# appBarAdd
source: Add
ar: اضف
el: Προσθήκη
th: เพิ่ม

# categoryTop
source: TOP
ar: الجزء العلوي
el: Πάνω μέρος
th: ชิ้นบน

# categoryBottom
source: BOTTOM
ar: الحزء السفلي
el: Κάτω μέρος
th: ชื้นล่าง

# categoryShoes
source: SHOES
ar: الأحذية
el: Παπούτσια
th: รองเท้า

# categoryAccessories
source: ACCESSORIES
ar: الاكسسوارات
el: Αξεσουάρ
th: เครื่องประดับ

# categoryInnerwear
source: INNERWEAR
ar: الملابس الداخلية
el: Εσώρουχα
th: ชุดชั้นใน

# categoryOther
source: OTHER
ar: شيء آخر
el: Άλλα
th: อื่นๆ
